TEST_DATA_1 = [
    {"name": "Тестовый объект", "data": {"ключ": "значение"}},
    {"name": "12345", "data": {"число": 42}},
    {"name": "Спецсимволы!@#", "data": {"символы": "!@#$%^&*()"}},
    {"name": " ", "data": {"пробел": " "}},
    {"name": "", "data": {}},
    {"name": "Очень длинное имя объекта, которое превышает обычные ограничения",
     "data": {"длина": "очень длинное значение"}
     }
]
TEST_DATA_2 = [
    {"name": "Обновленный объект", "data": {"ключ": "новое значение"}},
    {"name": "12345", "data": {"число": 100}}
]
TEST_DATA_3 = [
    {"name": "1", "data": {"число": 100}}
]
NEGATIVE_DATA = [
    {"name": None, "data": {"ключ": "значение"}},
    {"name": "Тестовый объект", "data": None}
]
